wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer_V2/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "defines.h"
#include "../ErrorCodes/ErrorCodes.h"

#include <stdio.h>
#include <stdlib.h>
#include <inttypes.h>
#include <string.h>
#include <math.h>

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */
// @formatter:off

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	MainMenu_Layer			=	0x00,
	Desktop_Layer			=	0x01,
	GPS_Layer				=	0x02,
	CarInfo_Layer			=	0x03,
	JarvisInfo_Layer		=	0x04,
	Last3Diag_Layer			=	0x05,
	Last3Err_Layer			=	0x06,
	CarSettings_Layer		=	0x07,
	JarvisSettings_Layer	=	0x08,
	CruiseControl_Layer		=	0x09,

		/* CarSettings_Layer */
		ClearDiagnosticSnapshots	=	0x71,
		ClearTripMileage			=	0x72,
		WaterSettings_Layer			=	0x73,
		OilTempSettings_Layer		=	0x74,
		OilPressureSettings_Layer	=	0x75,
		FuelSettings_Layer			=	0x76,
		MainBatterySettings_Layer	=	0x77,
		AuxBatterySettings_Layer	=	0x78,

		/* JarvisSettings_Layer */
		ClearErrorsSnapshots		=	0x81,
		AdjPolishTime				=	0x82,
		AdjTimeZone					=	0x83,
		InterVoltSettings_Layer		=	0x84,
		InterTempSettings_Layer		=	0x85,
		BuzzerSettings_Layer		=	0x86,
		LCDSettings_Layer			=	0x87,

			/* CarSettings_Layer -> WaterSettings_Layer */
			WaterHighTempWarningThreshold	=	0x731,
			WaterHighTempAlarmThreshold		=	0x732,
			WaterHighTempFanOnThreshold		=	0x733,
			WaterHighTempFanOffThreshold	=	0x734,
			WaterTempWarningOn				=	0x735,
			WaterTempAlarmOn				=	0x736,
			WaterFanControlOn				=	0x737,
			WaterTempWarningBuzzerOn		=	0x738,
			WaterTempAlarmBuzzerOn			=	0x739,
			WaterTempWarningSnapshotOn		=	0x73A,
			WaterTempAlarmSnapshotOn		=	0x73B,

			/* CarSettings_Layer -> OilTempSettings_Layer */
			OilHighTempWarningThreshold		=	0x741,
			OilHighTempAlarmThreshold		=	0x742,
			OilTempWarningOn				=	0x743,
			OilTempAlarmOn					=	0x744,
			OilTempWarningBuzzerOn			=	0x745,
			OilTempAlarmBuzzerOn			=	0x746,
			OilTempWarningSnapshotOn		=	0x747,
			OilTempAlarmSpashotOn			=	0x748,

			/* CarSettings_Layer -> OilPressureSettings_Layer */
			OilHighPressureAlarmThreshold	=	0x751,
			OilLowPressureAlarmThreshold	=	0x752,
			OilPressureAnalogMeasurement	=	0x753,
			OilHighPressureAlarmOn			=	0x754,
			OilLowPressureAlarmOn			=	0x755,
			OilPressureAlarmBuzzerOn		=	0x756,
			OilPressureAlarmSnapshotOn		=	0x757,

			/* CarSettings_Layer -> FuelSettings_Layer */
			FuelLowLevelWarningThreshold	=	0x761,
			FuelLowLevelWarningOn			=	0x762,
			FuelLowLevelWarningBuzzerOn		=	0x763,

			/* CarSettings_Layer -> MainBatterySettings_Layer */
			MainBatteryLowVoltageAlarmThreshold		=	0x771,
			MainBatteryHighVoltageAlarmThreshold	=	0x772,
			MainBatteryLowVoltageAlarmOn			=	0x773,
			MainBatteryHighVoltageAlarmOn			=	0x774,
			MainBatteryLowVoltageAlarmBuzzerOn		=	0x775,
			MainBatteryHighVoltageAlarmBuzzerOn		=	0x776,
			MainBatteryLowVoltageSnapshotOn			=	0x777,
			MainBatteryHighVoltageSnapshotOn		=	0x778,

			/* CarSettings_Layer -> AuxBatterySettings_Layer */
			AuxBatteryLowVoltageAlarmThreshold		=	0x781,
			AuxBatteryHighVoltageAlarmThreshold		=	0x782,
			AuxBatteryLowVoltageAlarmOn				=	0x783,
			AuxBatteryHighVoltageAlarmOn			=	0x784,
			AuxBatteryLowVoltageAlarmBuzzerOn		=	0x785,
			AuxBatteryHighVoltageAlarmBuzzerOn		=	0x786,
			AuxBatteryLowVoltageSnapshotOn			=	0x787,
			AuxBatteryHighVoltageSnapshotOn			=	0x788,

			/* JarvisSettings_Layer -> InterVoltSettings_Layer */
			Supply5VLowThreshold		=	0x841,
			Supply5VHighThreshold		=	0x842,
			Supply3V3LowThreshold		=	0x843,
			Supply3V3HighThreshold		=	0x844,
			SupplyVinLowThreshold		=	0x845,
			Board3V3SupplyAlarmOn		=	0x846,
			Board3V3SupplyBuzzerAlarmOn	=	0x847,
			Board5VSupplyAlarmOn		=	0x848,
			Board5VSupplyBuzzerAlarmOn	=	0x849,
			BoardVinSupplyAlarmOn		=	0x85A,
			BoardVinSupplyBuzzerAlarmOn	=	0x85B,

			/* JarvisSettings_Layer -> InterTempSettings_Layer */
			DCDC5VHighTempThreshold		=	0x851,
			DCDC3V3HighTempThreshold	=	0x852,
			HBridgeHighTempThreshold	=	0x853,
			DCDC5VTempHighAlarmOn		=	0x854,
			DCDC5VTempeHighBuzzAlarmOn	=	0x855,
			DCDC3V3TempHighAlarmOn		=	0x856,
			DCDC3V3TempHighBuzzAlarmOn	=	0x857,
			HBridgeTempHighAlarmOn		= 	0x858,
			HBridgeTempHighBuzzAlarmOn	=	0x859,

			/* JarvisSettings_Layer -> BuzzerSettings_Layer */
			BuzzerMainSwitch			=	0x861,
			BuzzerMainAlarmsSwitch		=	0x862,
			BuzzerMainButtonsSwitch		=	0x863,
			BuzzerWhenShortPress		=	0x864,
			BuzzerWhenLongPress			=	0x865,

			/* JarvisSettings_Layer -> LCDSettings_Layer */
			BacklightBrightnessLevel	=	0x871,
			BacklightOffBrightnessLevel	=	0x872,
			SecondsToTurnOffBacklight	=	0x873,
			AutoBacklightOffStartHour	=	0x874,
			AutoBacklightOffEndHour		=	0x875,
			HomeScreen					=	0x876,
			AutoHomeReturnTime			=	0x877,
			AutoBacklightOff			=	0x878,

	AreYouSure_Layer		=	0xF000,
	Alarm_Layer				=	0xFFFF
}Enum_Layer;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	_void_type_					=	0,
	_boolean_type_				=	1,

	_carTemperature_type_		=	10,
	_carOilAnalogPressure_type_	=	11,
	_carOilBinaryPressure_type_	=	12,
	_cafFuelLevel_type_			=	13,
	_carVoltage_type_			=	14,

	_boardVoltage_type_			=	20,
	_boardTemperature_type_		=	21,

