wojtekgrzela/STM32CubeIDE/Zuk/Body_Computer_V2/Core/Inc/main.h
	_LCDSettings_type_			=	22,
	_LCD_Enum_Layer_type_		=	23,

	_timeHours_type_			=	24
}Enum_valueType;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	StepNotApplicable	=	0,
	StepByToogling		=	1,
	StepByOne			=	1,
	StepByOneTen		=	10,
	StepByOneHundred	=	100,
	StepByFifty			=	999050,
	StepByHundred		=	999100
}Enum_valueStepSize;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	Row1	=	0x00,
	Row2	=	0x01,
	Row3	=	0x02,
	Row4	=	0x03,
}Enum_LCDRow;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Diagnostic codes */
typedef enum
{
	DIAGNOSTICS_OK								= 0,

	WATER_TEMP_HIGH_WARNING						= 10,
	WATER_TEMP_HIGH_ALARM						= 11,

	OIL_TEMP_HIGH_WARNING						= 20,
	OIL_TEMP_HIGH_ALARM							= 21,

	LOW_VOLTAGE_MAIN_BATTERY_ALARM				= 30,
	HIGH_VOLTAGE_MAIN_BATTERY_ALARM				= 31,

	LOW_VOLTAGE_AUXILIARY_BATTERY_ALARM			= 40,
	HIGH_VOLTAGE_AUXILIARY_BATTERY_ALARM		= 41,

	UNKNOWN_ISSUE								= 0xF0F0
}Enum_DiagnosticCode;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	KeyState_Error		= 0,
	KeyState_Out 		= 1,
	KeyState_IgnitionOn	= 2,
	KeyState_Crank		= 3
}Enum_KeyState;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef enum
{
	CarState_Error		= 0,
	CarState_Off		= 1,
	CarState_Crank		= 2,
	CarState_Running	= 3
}Enum_CarState;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	Enum_KeyState keyState;
	Enum_CarState carState;

	uint32_t RPM;
	float SPEED;

	uint16_t ADC_AcceleratorValue;

	boolean AlternatorCharging;
}CarStateinfo_type;

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef float carTemperature_type;
typedef float carVoltage_type;
typedef float cafFuelLevel_type;
typedef float carOilAnalogPressure_type;
typedef boolean carOilBinaryPressure_type;

typedef float boardTemperature_type;
typedef float boardVoltage_type;
typedef uint8_t LCDSettings_type;
typedef uint16_t LCDBacklightSettings_type;

typedef int8_t timeHours_type;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Enum_DiagnosticCode Snapshot */
typedef struct
{
	Enum_DiagnosticCode snapshotIdentificator;			//4 bytes total
	float value;										//8 bytes total

}Diagnostic_Snapshot_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Error_code Snapshot */
typedef struct
{
	Error_Code snapshotIdentificator;					//4 bytes total
	float value;										//8 bytes total
}Error_Snapshot_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* ENCODER BUTTON STRUCT */
typedef union
{
	uint8_t allFlags;
	struct
	{
		uint8_t shortPressDetected		:1;	/* LSB!!! */
		uint8_t longPressDetected		:1;

		uint8_t longPressInfoForISR		:1;	/* This is an info for the external
												interrupt callback that there
												was a long press detected and
												not to set the short press on */
		uint8_t shortPressDetectedBuzzer	:1;
		uint8_t longPressDetectedBuzzer		:1;
	};
}ENCButton_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	carTemperature_type waterHighTempWarningThreshold;
	carTemperature_type waterHighTempAlarmThreshold;
	carTemperature_type waterHighTempFanOnThreshold;
	carTemperature_type waterHighTempFanOffThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			boolean waterTempWarningOn			:1;
			boolean waterTempAlarmOn			:1;
			boolean waterFanControlOn			:1;
			boolean waterTempWarningBuzzerOn	:1;
			boolean waterTempAlarmBuzzerOn		:1;
			boolean waterTempWarningSnapshotOn 	:1;
			boolean waterTempAlarmSnapshotOn	:1;
			/* 1 more free bits here */
		};
	};
}waterTempSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	carTemperature_type oilHighTempWarningThreshold;
	carTemperature_type oilHighTempAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			boolean oilTempWarningOn			:1;
			boolean oilTempAlarmOn				:1;
			boolean oilTempWarningBuzzerOn		:1;
			boolean oilTempAlarmBuzzerOn		:1;
			boolean oilTempWarningSnapshotOn	:1;
			boolean oilTempAlarmSnapshotOn		:1;
			/* 2 more free bits here */
		};
	};
}oilTempSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	carVoltage_type batteryLowVoltageAlarmThreshold;
	carVoltage_type batteryHighVoltageAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			boolean lowVoltageAlarmOn				:1;
			boolean highVoltageAlarmOn				:1;
			boolean lowVoltageAlarmBuzzerOn			:1;
			boolean highVoltageAlarmBuzzerOn		:1;
			boolean lowVoltageAlarmSnapshotOn		:1;
			boolean highVoltageAlarmSnapshotOn		:1;
			/* 2 more free bits here */
		};
	};
}batterySettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	cafFuelLevel_type fuelLowLevelWarningThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			boolean lowFuelLevelWarningOn			:1;
			boolean lowFuelLevelWarningBuzzerOn		:1;
		};
	};
}fuelSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	carOilAnalogPressure_type oilHighPressureAlarmThreshold;
	carOilAnalogPressure_type oilLowPressureAlarmThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			boolean oilPressureAnalogMeasurement	:1;
			boolean oilHighPressureAlarmOn			:1;
			boolean oilLowPressureAlarmOn			:1;
			boolean oilPressureAlarmBuzzerOn		:1;
			boolean oilPressureAlarmSnapshotOn		:1;
			/* 3 more free bits here */
		};
	};
}oilPressureSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef union
{
	uint8_t data[8];
	struct
	{
		uint32_t totalMileage; /* in meters */
		uint32_t tripMileage;  /* in meters */
	};
}CAR_mileage_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t diagnosticSnapshotEEPROMIndex;
	boolean didTheNumberOfDiagnosticSnapshotsOverflowed;
}CAR_EEPROM_counters_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *//* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	boardVoltage_type board3V3SupplyLowThreshold;
	boardVoltage_type board3V3SupplyHighThreshold;
	boardVoltage_type board5VSupplyLowThreshold;
	boardVoltage_type board5VSupplyHighThreshold;
	boardVoltage_type boardVinSupplyLowThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t board3V3SupplyAlarmOn		:1;
			uint8_t board3V3SupplyBuzzerAlarmOn	:1;
			uint8_t board5VSupplyAlarmOn		:1;
			uint8_t board5VSupplyBuzzerAlarmON	:1;
			uint8_t boardVinSupplyAlarmOn		:1;
			uint8_t boardVinSupplyBuzzerAlarmOn	:1;
			/* 2 more free bits here */
		};
	};
}boardVoltagesSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	boardTemperature_type board5VDCDCTemperatureHighThreshold;
	boardTemperature_type board3V3DCDCTemperatureHighThreshold;
	boardTemperature_type boardHBridgeTemperatureHighThreshold;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t board5VDCDCTemperatureHighAlarmON			:1;
			uint8_t board5VDCDCTemperatureHighBuzzerAlarmOn		:1;
			uint8_t board3V3DCDCTemperatureHighAlarmOn			:1;
			uint8_t board3V3DCDCTemperatureHighBuzzerAlarmOn	:1;
			uint8_t boardHBridgeTemperatureHighAlarmOn			:1;
			uint8_t boardHBridgeTemperatureHighBuzzerAlarmOn	:1;
			/* 4 more free bits here */
		};
	};
}boardTemperaturesSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t buzzerMainSwitchOn			:1;
			uint8_t buzzerMainAlarmsSwitchOn	:1;
			uint8_t buzzerMainButtonsSwitchOn	:1;
			uint8_t buzzerWhenShortPressOn		:1;
			uint8_t buzzerWhenLognPressOn		:1;
		};
	};
}buzzerMainSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	Enum_Layer homeScreen;	// should be 4 bytes
	LCDSettings_type autoHomeReturnTime;
	LCDBacklightSettings_type backlightLevel;
	LCDBacklightSettings_type backlightOffLevel;
	LCDSettings_type secondsToAutoTurnOffBacklight;
	LCDSettings_type autoBacklightOffHourStart;
	LCDSettings_type autoBacklightOffHourEnd;

	union
	{
		uint8_t allSettings;
		struct
		{
			uint8_t autoBacklightOffAtNightOn	:1;
			/* 7 more free bits here */
		};
	};
}LCDMainSettings_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	uint8_t errorSnapshotEEPROMIndex;
	uint8_t didTheNumberOfErrorSnapshotsOverflowed;
}BOARD_EEPROM_counters_struct;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	boolean signalBuzzerIndication;
	boolean signalBuzzerDone;
	boolean signalSnapshotIndication;
	boolean signalSnapshotDone;
	boolean* signalSetting1;
	boolean* signalSetting2;
	void (*BuzzerSignal)(void);
}valueSignal_type;
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
typedef struct
{
	const float polishTimeAdj_min;
	const float polishTimeAdj_max;
	const float timeZoneAdj_min;
	const float timeZoneAdj_max;

	const float waterHighTempWarningThreshold_min;
	const float waterHighTempWarningThreshold_max;
	const float waterHighTempAlarmThreshold_min;
	const float waterHighTempAlarmThreshold_max;
	const float waterHighTempFanOnThreshold_min;
	const float waterHighTempFanOnThreshold_max;
	const float waterHighTempFanOffThreshold_min;
	const float waterHighTempFanOffThreshold_max;

	const float oilHighTempWarningThreshold_min;
	const float oilHighTempWarningThreshold_max;
	const float oilHighTempAlarmThreshold_min;
	const float oilHighTempAlarmThreshold_max;

	const float oilHighPressureAlarmThreshold_min;
	const float oilHighPressureAlarmThreshold_max;
	const float oilLowPressureAlarmThreshold_min;
	const float oilLowPressureAlarmThreshold_max;

